[Killed] PublicVisibility
inventory-track/src/UseCases/ManageInventory.php:15:5
         private InventoryRepository $inventoryRepository,
     ) {}
 
-    public function create(InventoryAdapter $inventoryAdapter) : Result {
+    protected function create(InventoryAdapter $inventoryAdapter) : Result
         $serialNumber = $inventoryAdapter->getSerialNumber();
         $oldInventory = $this->inventoryRepository->findBySerialNumber($serialNumber);
killedBy: hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0
statusReason: 1) hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0 (Mock_InventoryAdapter_c0347bd5 Object (...), Mock_InventoryRepository_7bf1e730 Object (...), hdvianna\InventoryTrack\UseCases\Result Object (...))
Error: Call to protected method hdvianna\InventoryTrack\UseCases\ManageInventory::create() from scope hdvianna\InventoryTrack\Tests\UseCases\ManageInven

[Killed] MethodCallRemoval
inventory-track/src/UseCases/ManageInventory.php:20:13
         $oldInventory = $this->inventoryRepository->findBySerialNumber($serialNumber);
         if (is_null($oldInventory)) {
             $newInventory = new Inventory($inventoryAdapter->getName(), $serialNumber, $inventoryAdapter->getValue());
-            $this->inventoryRepository->insert($newInventory);
+            
             return new Result(true, ResultStatus::CreationSuccess, $newInventory);
         } else {
killedBy: hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0
statusReason: 1) hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0 (Mock_InventoryAdapter_a2b18ec5 Object (...), Mock_InventoryRepository_3c830139 Object (...), hdvianna\InventoryTrack\UseCases\Result Object (...))
Expectation failed for method name is "insert" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tes

[Killed] TrueValue
inventory-track/src/UseCases/ManageInventory.php:21:13
         if (is_null($oldInventory)) {
             $newInventory = new Inventory($inventoryAdapter->getName(), $serialNumber, $inventoryAdapter->getValue());
             $this->inventoryRepository->insert($newInventory);
-            return new Result(true, ResultStatus::CreationSuccess, $newInventory);
+            return new Result(false, ResultStatus::CreationSuccess, $newInventory);
         } else {
             return new Result(false, ResultStatus::CreationFailedInventoryAlreadyExists, null);
killedBy: hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0
statusReason: 1) hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0 (Mock_InventoryAdapter_85987d2e Object (...), Mock_InventoryRepository_11d9b0bd Object (...), hdvianna\InventoryTrack\UseCases\Result Object (...))
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 hdvianna\InventoryTrack\UseCases\Result Object (
-    'success' => true
+

[Killed] FalseValue
inventory-track/src/UseCases/ManageInventory.php:23:13
             $this->inventoryRepository->insert($newInventory);
             return new Result(true, ResultStatus::CreationSuccess, $newInventory);
         } else {
-            return new Result(false, ResultStatus::CreationFailedInventoryAlreadyExists, null);
+            return new Result(true, ResultStatus::CreationFailedInventoryAlreadyExists, null);
         }
     }
killedBy: hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #1
statusReason: 1) hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #1 (Mock_InventoryAdapter_790262e6 Object (...), Mock_InventoryRepository_b8d596bc Object (...), hdvianna\InventoryTrack\UseCases\Result Object (...))
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 hdvianna\InventoryTrack\UseCases\Result Object (
-    'success' => false
+
