[Killed] PublicVisibility
inventory-track/src/UseCases/ManageInventory.php:17:5
         private InventoryRepository $inventoryRepository,
     ) {}
 
-    public function create(InventoryAdapter $inventoryAdapter) : ManageInventoryResult {
+    protected function create(InventoryAdapter $inventoryAdapter) : ManageInventoryResult
         $serialNumber = $inventoryAdapter->getSerialNumber();
         $oldInventory = $this->inventoryRepository->findBySerialNumber($serialNumber);
killedBy: hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0
statusReason: 1) hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0 (Mock_InventoryAdapter_f805ee05 Object (...), Mock_InventoryRepository_754899f1 Object (...), hdvianna\InventoryTrack\UseCases\Results\ManageInventoryResult Object (...))
Error: Call to protected method hdvianna\InventoryTrack\UseCases\ManageInventory::create() from scope hdvianna\InventoryTrack\Tes

[Killed] TrueValue
inventory-track/src/UseCases/ManageInventory.php:23:13
         if (is_null($oldInventory)) {
             $newInventory = new Inventory($inventoryAdapter->getName(), $serialNumber, $inventoryAdapter->getValue());
             $this->inventoryRepository->insert($newInventory);
-            return new ManageInventoryResult(true, ManageInventoryResultStatus::CreationSuccess, $newInventory);
+            return new ManageInventoryResult(false, ManageInventoryResultStatus::CreationSuccess, $newInventory);
         } else {
             return new ManageInventoryResult(false, ManageInventoryResultStatus::CreationFailedInventoryAlreadyExists, null);
killedBy: hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0
statusReason: 1) hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #0 (Mock_InventoryAdapter_b00ba9a7 Object (...), Mock_InventoryRepository_8cb83965 Object (...), hdvianna\InventoryTrack\UseCases\Results\ManageInventoryResult Object (...))
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 hdvianna\InventoryTrack\UseCases\Results\ManageInvent

[Killed] FalseValue
inventory-track/src/UseCases/ManageInventory.php:25:13
             $this->inventoryRepository->insert($newInventory);
             return new ManageInventoryResult(true, ManageInventoryResultStatus::CreationSuccess, $newInventory);
         } else {
-            return new ManageInventoryResult(false, ManageInventoryResultStatus::CreationFailedInventoryAlreadyExists, null);
+            return new ManageInventoryResult(true, ManageInventoryResultStatus::CreationFailedInventoryAlreadyExists, null);
         }
     }
killedBy: hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #1
statusReason: 1) hdvianna\InventoryTrack\Tests\UseCases\ManageInventoryTest::testCreateInventory with data set #1 (Mock_InventoryAdapter_4122c476 Object (...), Mock_InventoryRepository_28882b5a Object (...), hdvianna\InventoryTrack\UseCases\Results\ManageInventoryResult Object (...))
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 hdvianna\InventoryTrack\UseCases\Results\ManageInvent
